DataProcessors/ПанельФункций.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<DataProcessor>
		<Properties>
			<Name>ПанельФункций</Name>
		</Properties>
	</DataProcessor>
</MetaDataObject>

InformationRegisters/РезультатТеста.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>РезультатТеста</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ПравельныеОтветы</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НеправельныеОтветы</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВопросовВсего</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Время</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПроцентОшибок</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Глава</Name>
					<Type>
						<v8:Type>cfg:EnumRef.Главы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидТестирования</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидТестирования</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

DataProcessors/ПанельФункций/Forms/Форма/Ext/Form/Module.bsl
&НаКлиенте
Процедура Константы(Команда)
	//Способ №1
	ОткрытьФорму("ОбщаяФорма.ФормаКонстант");
КонецПроцедуры

&НаКлиенте
Процедура НачатьТест(Команда)
	ОткрытьФорму("Обработка.Тест.Форма.Форма");
КонецПроцедуры

&НаКлиенте
Процедура ВыбранныеВопросы(Команда)
	ОткрытьФорму("РегистрСведений.ВыбранныеВопросы.Форма.ФормаСписка");
КонецПроцедуры

&НаКлиенте
Процедура РаботаНадОшибками(Команда)
	ОткрытьФорму("РегистрСведений.НеправельныеОтветы.Форма.ФормаСписка");
КонецПроцедуры

&НаКлиенте
Процедура ВопросыДляТаста(Команда)
	ОткрытьФорму("Справочник.ВопросыТест.Форма.ФормаСписка"); 
КонецПроцедуры

&НаКлиенте
Процедура РезультатыТеста(Команда)
	ОткрытьФорму("РегистрСведений.РезультатТеста.Форма.ФормаСписка");
КонецПроцедуры

&НаКлиенте
Процедура Проверка(Команда)
	ОткрытьФорму("Обработка.ТестПроверка.Форма.Форма");
КонецПроцедуры

&НаКлиенте
Процедура НеправельныеОтветы(Команда)
	ОткрытьФорму("РегистрСведений.НеПравельныеОтветыУчитьЗаново.Форма.ФормаСписка");
КонецПроцедуры

&НаКлиенте
Процедура ПравельныеОтветы(Команда)
	ОткрытьФорму("РегистрСведений.ПравельныеОтветы.Форма.ФормаСписка");
КонецПроцедуры

&НаКлиенте
Процедура ОпределитьКоличествоВопросов()
	НеправельныеОтветыВсего = ОбщееСервер.ОпределитьКоличествоНеправельныхВопросов();
	ПравельныеОтветыВсего = ОбщееСервер.ОпределитьКоличествоПравельныхВопросов();
	ВсегоВопросов = ОбщееСервер.ВсегоВопросов();   
	
	ОсталосьВопросов 	  = ВсегоВопросов - ПравельныеОтветыВсего; 
	ПройденоВопросовВсего =  ПравельныеОтветыВсего +  НеправельныеОтветыВсего;
КонецПроцедуры	

&НаКлиенте
Процедура ПройденоТестов()
	ПройденоТестов = ОбщееСервер.ПройденоТестов();	
КонецПроцедуры	

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ОпределитьКоличествоВопросов();
	ПройденоТестов();  
	ОбновитьФорму();
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьФорму()
	ПодключитьОбработчикОжидания("ДанныеДляобновления",30);	
КонецПроцедуры     

&НаКлиенте
Процедура ДанныеДляобновления() 
	ОпределитьКоличествоВопросов();
	ПройденоТестов();  	
КонецПроцедуры
